In [2]:
import numpy as np
import pandas as pd

In [4]:
df1=pd.DataFrame({'A':['AO','A1','A2','A3'],
                 'B':['AO','A1','A2','A3'],
                 'C':['AO','A1','A2','A3'],
                 'D':['AO','A1','A2','A3']})

df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['A4','A5','A6','A7'],
                 'C':['A4','A5','A6','A7'],
                 'D':['A4','A5','A6','A7']})

df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['A8','A9','A10','A11'],
                 'C':['A8','A9','A10','A11'],
                 'D':['A8','A9','A10','A11']})
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  AO  AO  AO  AO
1  A1  A1  A1  A1
2  A2  A2  A2  A2
3  A3  A3  A3  A3
    A   B   C   D
0  A4  A4  A4  A4
1  A5  A5  A5  A5
2  A6  A6  A6  A6
3  A7  A7  A7  A7
     A    B    C    D
0   A8   A8   A8   A8
1   A9   A9   A9   A9
2  A10  A10  A10  A10
3  A11  A11  A11  A11

In [6]:
pd.concat([df1,df2,df3])

     A    B    C    D
0   AO   AO   AO   AO
1   A1   A1   A1   A1
2   A2   A2   A2   A2
3   A3   A3   A3   A3
0   A4   A4   A4   A4
1   A5   A5   A5   A5
2   A6   A6   A6   A6
3   A7   A7   A7   A7
0   A8   A8   A8   A8
1   A9   A9   A9   A9
2  A10  A10  A10  A10
3  A11  A11  A11  A11

In [8]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  AO  AO  AO  AO  A4  A4  A4  A4   A8   A8   A8   A8
1  A1  A1  A1  A1  A5  A5  A5  A5   A9   A9   A9   A9
2  A2  A2  A2  A2  A6  A6  A6  A6  A10  A10  A10  A10
3  A3  A3  A3  A3  A7  A7  A7  A7  A11  A11  A11  A11

In [12]:
left_df=pd.DataFrame({'join_keys':['a','b','c','d'],
                     'values':np.random.randint(10,99,4)})
print(left_df)

right_df=pd.DataFrame({'join_keys':['b','d','e','f'],
                      'values':np.random.randint(10,99,4)})

print(right_df)

  join_keys  values
0         a      18
1         b      14
2         c      76
3         d      81
  join_keys  values
0         b      53
1         d      40
2         e      97
3         f      93

In [15]:
pd.merge(left_df,right_df,how="inner",on="join_keys")

  join_keys  values_x  values_y
0         b        14        53
1         d        81        40

In [17]:
pd.merge(left_df,right_df,how="outer",on="join_keys")

  join_keys  values_x  values_y
0         a      18.0       NaN
1         b      14.0      53.0
2         c      76.0       NaN
3         d      81.0      40.0
4         e       NaN      97.0
5         f       NaN      93.0

In [19]:
pd.merge(left_df,right_df,how="left",on="join_keys")

  join_keys  values_x  values_y
0         a        18       NaN
1         b        14      53.0
2         c        76       NaN
3         d        81      40.0

In [21]:
pd.merge(left_df,right_df,how="right",on="join_keys")

  join_keys  values_x  values_y
0         b      14.0        53
1         d      81.0        40
2         e       NaN        97
3         f       NaN        93

In [40]:
left=pd.DataFrame({'A':['A0','A1','A2',"A3"],
                  'B':['B0','B1','B2','B3']},
                  index=['K0','K1','K2','K3'])

right=pd.DataFrame({'C':['AA0','AS1','Aas2'],
                  'D':['Bsdv0','Bsvd1','svdB2']},
                  index=['K0','K1','K2'])

In [41]:
print(left)
right

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

       C      D
K0   AA0  Bsdv0
K1   AS1  Bsvd1
K2  Aas2  svdB2

In [46]:
left.join(right,how='right' )

     A   B     C      D
K0  A0  B0   AA0  Bsdv0
K1  A1  B1   AS1  Bsvd1
K2  A2  B2  Aas2  svdB2

In [48]:
#operations
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})
print(df)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [51]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [53]:
df['col2'].sum()

2109

In [55]:
df['col2'].mean()

527.25

In [58]:
df['col2'].nunique()

3

In [60]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [62]:
df['col2'].sum()

2109

In [64]:
#custom funvtion on df,
# we use apply method
def mul_2(x):
    return x*2

In [68]:
print(df)
df['col2'].apply(mul_2)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [73]:
len(df['col2'])

4

In [76]:
print(df)
df.columns

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Index(['col1', 'col2', 'col3'], dtype='object')

In [78]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [83]:
print(df[df.isnull()])
df.isnull()

   col1  col2 col3
0   NaN   NaN  NaN
1   NaN   NaN  NaN
2   NaN   NaN  NaN
3   NaN   NaN  NaN

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [85]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [86]:
print(df)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz